## Production: lambda-api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 6 to add, 1 to change, 4 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_base_path_mapping.api will be created
  + resource "aws_api_gateway_base_path_mapping" "api" {
      + api_id      = "71oj6jax35"
      + domain_name = "api-lambda.notification.canada.ca"
      + id          = (known after apply)
      + stage_name  = "v1"
    }

  # aws_api_gateway_domain_name.api will be created
  + resource "aws_api_gateway_domain_name" "api" {
      + arn                      = (known after apply)
      + certificate_upload_date  = (known after apply)
      + cloudfront_domain_name   = (known after apply)
      + cloudfront_zone_id       = (known after apply)
      + domain_name              = "api-lambda.notification.canada.ca"
      + id                       = (known after apply)
      + regional_certificate_arn = "arn:aws:acm:ca-central-1:296255494825:certificate/562e7b2c-c913-4fbd-bfd5-d2f58d3c09dc"
      + regional_domain_name     = (known after apply)
      + regional_zone_id         = (known after apply)
      + security_policy          = "TLS_1_2"
      + tags_all                 = (known after apply)

      + endpoint_configuration {
          + types = [
              + "REGIONAL",
            ]
        }
    }

  # aws_appautoscaling_scheduled_action.api-5pm must be replaced
-/+ resource "aws_appautoscaling_scheduled_action" "api-5pm" {
      ~ arn                = "arn:aws:autoscaling:ca-central-1:296255494825:scheduledAction:2ed75b89-1ade-40c8-b8f8-707576ac17a0:resource/lambda/function:api-lambda:1:scheduledActionName/api-5pm" -> (known after apply)
      ~ id                 = "api-5pm-lambda-function:api-lambda:1" -> (known after apply)
        name               = "api-5pm"
      ~ resource_id        = "function:api-lambda:1" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_appautoscaling_scheduled_action.api-noon must be replaced
-/+ resource "aws_appautoscaling_scheduled_action" "api-noon" {
      ~ arn                = "arn:aws:autoscaling:ca-central-1:296255494825:scheduledAction:2ed75b89-1ade-40c8-b8f8-707576ac17a0:resource/lambda/function:api-lambda:1:scheduledActionName/api-noon" -> (known after apply)
      ~ id                 = "api-noon-lambda-function:api-lambda:1" -> (known after apply)
        name               = "api-noon"
      ~ resource_id        = "function:api-lambda:1" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_appautoscaling_target.api must be replaced
-/+ resource "aws_appautoscaling_target" "api" {
      ~ id                 = "function:api-lambda:1" -> (known after apply)
      ~ resource_id        = "function:api-lambda:1" -> (known after apply) # forces replacement
      ~ role_arn           = "arn:aws:iam::296255494825:role/aws-service-role/lambda.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_LambdaConcurrency" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "api-lambda"
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:296255494825:function:api-lambda:1" -> (known after apply)
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "ADMIN_CLIENT_USER_NAME"         = (sensitive)
              ~ "ASSET_DOMAIN"                   = "assets.notification.canada.ca" -> ""
              ~ "ASSET_UPLOAD_BUCKET_NAME"       = "notification-canada-ca-production-asset-upload" -> ""
              ~ "CSV_UPLOAD_BUCKET_NAME"         = "notification-canada-ca-production-csv-upload" -> ""
              ~ "DOCUMENTS_BUCKET"               = "notification-alpha-canada-ca-document-download" -> ""
                # (16 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_provisioned_concurrency_config.api must be replaced
-/+ resource "aws_lambda_provisioned_concurrency_config" "api" {
      ~ id                                = "api-lambda:1" -> (known after apply)
      ~ provisioned_concurrent_executions = 3 -> 1
      ~ qualifier                         = "1" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 6 to add, 1 to change, 4 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>